{
    "title": "GEWtool",
    "description": "<p><strong>Compute guided elastic wave (GEW) dispersion in MATLAB.</strong></p><p><code>GEWtool</code> is an advanced system to compute and postprocess guided elastodynamic waves (GEWs) in plates and cylinders. It is simple to use yet provides full access to the computational results as well as the underlying code. You are welcome to contribute to this open-source project.</p><p><strong>Features</strong>:</p><ul><li>Multi-layered plates, tubes and rods</li><li>General anisotropy, <strong>piezoelectricity</strong>, dissipation</li><li>Super fast, guarantees to find all solutions</li><li>Compute real frequencies, complex wavenumbers, or ZGV points</li><li>Choose polarization (Lamb/SH/coupled) and parity (S/A)</li></ul><p><strong>More information:</strong>: <a href=https://github.com/dakiefer/GEWtool>https://github.com/dakiefer/GEWtool</a></p>",
    "creators": [
        {
            "name": "Kiefer, Daniel A.",
            "affiliation": "Institut Langevin, ESPCI Paris, Université PSL",
            "orcid": "0000-0003-0776-8429"
        }
    ],
    "contributors": [
        {
            "type": "RelatedPerson",
            "name": "Plestenjak, Bor",
            "affiliation": "Faculty of Mathematics and Physics, University of Ljubljana",
            "orcid": "0000-0002-0463-7223"
        },
        {
            "type": "RelatedPerson",
            "name": "Clement, Gatien",
            "affiliation": "Institut Langevin, ESPCI Paris, Université PSL"
        },
        {
            "type": "RelatedPerson",
            "name": "Grünsteidl, Clemens",
            "affiliation": "Research Center for Non Destructive Testing GmbH (RECENDT)",
            "orcid": "0000-0001-5101-8479"
        }
    ],
    "upload_type": "software",
    "license": "isc",
    "references": [ 
        "D. A. Kiefer, S. Mezil, and C. Prada, \"Beating resonance patterns and extreme power flux skewing in anisotropic elastic plates,\" Science Advances, vol. 9, no. 51, p. eadk6846, Dec. 2023, http://doi.org/10.1126/sciadv.adk6846",
        "D. A. Kiefer, S. Mezil, and C. Prada, \"Extreme wave skewing and dispersion spectra of anisotropic elastic plates,\" Phys. Rev. Res., vol. 7, no. 1, p. L012043, Feb. 2025, http://doi.org/10.1103/PhysRevResearch.7.L012043",
        "D. A. Kiefer, G. Watzl, K. Burgholzer, M. Ryzy, and C. Grünsteidl, \"Electroelastic guided wave dispersion in piezoelectric plates: Spectral methods and laser-ultrasound experiments,\" Journal of Applied Physics, vol. 137, no. 11, p. 114502, Mar. 2025, doi: https://doi.org/10.1063/5.0250494",
        "H. Gravenkamp, B. Plestenjak, and D. A. Kiefer, \"Notes on osculations and mode tracing in semi-analytical waveguide modeling,\" Ultrasonics, vol. 135, p. 107112, Jul. 2023, http://doi.org/10.1016/j.ultras.2023.107112",
        "D. A. Kiefer, B. Plestenjak, H. Gravenkamp, and C. Prada, \"Computing zero-group-velocity points in anisotropic elastic waveguides: Globally and locally convergent methods,\" The Journal of the Acoustical Society of America, vol. 153, no. 2, pp. 1386–1398, Feb. 2023, http://doi.org/10.1121/10.0017252",
        "D. A. Kiefer, Elastodynamic quasi-guided waves for transit-time ultrasonic flow metering. in FAU Forschungen, Reihe B, Medizin, Naturwissenschaft, Technik, no. 42. Erlangen: FAU University Press, 2022. http://doi.org/10.25593/978-3-96147-550-6"
    ],
    "keywords": ["guided waves", "dispersion", "Lamb waves", "piezoelectricity", "SAW", "elastodynamics", "ultrasound", "zero-group-velocity", "anisotropy"]
}